from django import template
import regex as re

# ABUSE = ['кринж', 'рофл', 'угар', 'треш', 'скам', 'стеб', 'изи', 'го', 'чекай', 'душнила', 'лох', 'кидок',
#          'инфасотка', 'кстада', 'краш', 'чсв', 'чиллить', 'хайп', 'агриться', 'занквар', 'вайб', 'хейтить', 'флексить']
ABUSE = ['пизд', 'ху', 'бляд']


register = template.Library()

@register.filter(name='censor')
def censor(value):
    for ab in ABUSE:
        m = re.search(rf'{ab}\w+', value)
        if m:
            value = value.replace(m[0], '***')
    return value

#
# value = 'Владимир Маяковский:\n' \
#         'Вы любите розы?\n' \
#         'А я на них срал!\n'\
#         'Стране нужны паровозы,\n'\
#         'Нам нужен металл!\n'\
#         'Товарищ! не охай,\n'\
#         'Не ахай!\n' \
#         'Не дёргай узду!\n'\
#         'Коль выполнил план,\n' \
#         'Посылай всех\n'\
#         'В пизду,\n'\
#         'Не выполнил —\n'\
#         'Сам\n'\
#         'Иди\n'\
#         'На хуй.'



